In [1]:
import pandas as pd
import sqlite3
import json

In [2]:
customers = pd.read_csv("customers.csv")
accounts = pd.read_csv("accounts.csv")
transactions = pd.read_csv("transactions.csv")
branches = pd.read_csv("branches.csv")
loans = pd.read_json("loans.json")
support_tickets = pd.read_json("support_tickets.json")

In [3]:
customers.head()

,customer_id,name,gender,age,city,account_type,join_date
0,C0001,Richard Wilson,M,65,Kimberlyburgh,Savings,2023-08-27
1,C0002,Holly Parker,F,41,Port David,Current,2023-12-08
2,C0003,Megan Alvarez,M,46,West Laurieton,Savings,2022-05-25
3,C0004,Nicholas Stewart,F,39,Amyville,Current,2020-11-30
4,C0005,Douglas Anderson,M,70,New Craigport,Current,2023-01-29

In [4]:
customers.isnull().sum()

customer_id     0
name            0
gender          0
age             0
city            0
account_type    0
join_date       0
dtype: int64

In [5]:
conn = sqlite3.connect("bankdata.db")
cursor = conn.cursor()

In [6]:
customers.to_sql("customers", conn, if_exists="replace", index=False)

500

In [7]:
df = pd.read_sql("SELECT * FROM customers", conn)
df

,customer_id,name,gender,age,city,account_type,join_date
0,C0001,Richard Wilson,M,65,Kimberlyburgh,Savings,2023-08-27
1,C0002,Holly Parker,F,41,Port David,Current,2023-12-08
2,C0003,Megan Alvarez,M,46,West Laurieton,Savings,2022-05-25
3,C0004,Nicholas Stewart,F,39,Amyville,Current,2020-11-30
4,C0005,Douglas Anderson,M,70,New Craigport,Current,2023-01-29
...,...,...,...,...,...,...,...
495,C0496,Jennifer Flores,M,50,Mullenland,Savings,2021-04-03
496,C0497,Melissa Martin,M,41,Shermanfurt,Current,2021-12-27
497,C0498,Christopher Johnson,M,69,Nataliemouth,Savings,2022-10-10
498,C0499,Alvin Compton,M,30,Millerstad,Current,2023-06-16
499,C0500,Emily Brooks,M,47,South Louismouth,Savings,2023-10-11

In [30]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in d:\banksight_project\.venv\lib\site-packages (9.5.0)

In [10]:
import mysql.connector

In [26]:
conn = mysql.connector.connect(
    host="localhost",      
    user="root",           
    password="Tech@080102"    
)
cursor = conn.cursor()

In [23]:
cursor.execute("CREATE DATABASE IF NOT EXISTS customer_data")
print("✅ Database created or already exists.")

✅ Database created or already exists.

In [28]:
cursor.execute("USE customer_data")

In [29]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS customers (
    customer_id VARCHAR(10) PRIMARY KEY,
    name VARCHAR(50),
    gender CHAR(1),
    age INT,
    city VARCHAR(50),
    account_type VARCHAR(20),
    join_date DATE
)
""")

In [31]:
for _, row in customers.iterrows():
    cursor.execute("""
        INSERT INTO customers (customer_id, name, gender, age, city, account_type, join_date)
        VALUES (%s, %s, %s, %s, %s, %s, %s)
    """, (row['customer_id'], row['name'], row['gender'], row['age'], row['city'], row['account_type'], row['join_date']))

conn.commit()